app/controllers/properties_controller.rb

	def index
		byebug
		@properties = Property.page(params[:page]).per(10)
---
SELECT  "properties".* FROM "properties" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 10]]
SELECT COUNT(*) FROM (SELECT  1 AS one FROM "properties" LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 10], ["OFFSET", 40]]

	def show
		@property = Property.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def update
		@property = Property.find(params[:id])
		if @property.update(property_params)
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "properties" SET "price_per_night" = $1 WHERE "properties"."id" = $2  [["price_per_night", 0], ["id", 1]]

	def edit
		@property = Property.find(params[:id])
		@user = User.find(params[:id])
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]