app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    # byebug
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password", "remember_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"