app/models/user.rb

INSERT INTO "users" ("created_at", "updated_at", "email", "encrypted_password", "remember_token") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "authentications" ("uid", "token", "provider", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
 def self.create_with_auth_and_hash(authentication, auth_hash)
   user = self.create!(
     # name: auth_hash["info"]["name"],
     email: auth_hash["info"]["email"],
     password: SecureRandom.hex(10)

   )
   user.authentications << authentication